Tekla.Structures.Solid.FaceEnumerator.#ctor(System.Collections.Generic.List{System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}}},System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t})
Instantiates a new face enumerator. This constructor should
only be called by someone inheriting from ISolid.
Enumerator: The father solid's face list enumerator.
VectorEnumerator: The father solid's face normal vector enumerator.